Terraform plan in prod:
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.stateful.aws_cloudwatch_log_group.bfd_pipeline_aurora_messages_txt will be destroyed
  - resource "aws_cloudwatch_log_group" "bfd_pipeline_aurora_messages_txt" {
      - arn               = "arn:aws:logs:us-east-1:577373831711:log-group:/bfd/prod/bfd-pipeline-aurora/messages.txt:*" -> null
      - id                = "/bfd/prod/bfd-pipeline-aurora/messages.txt" -> null
      - kms_key_id        = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6" -> null
      - name              = "/bfd/prod/bfd-pipeline-aurora/messages.txt" -> null
      - retention_in_days = 0 -> null
      - tags              = {
          - "Environment" = "prod"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "stack"       = "prod"
        } -> null
    }

  # module.stateful.aws_cloudwatch_log_group.bfd_server_aurora_access_json will be destroyed
  - resource "aws_cloudwatch_log_group" "bfd_server_aurora_access_json" {
      - arn               = "arn:aws:logs:us-east-1:577373831711:log-group:/bfd/prod/bfd-server-aurora/access.json:*" -> null
      - id                = "/bfd/prod/bfd-server-aurora/access.json" -> null
      - kms_key_id        = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6" -> null
      - name              = "/bfd/prod/bfd-server-aurora/access.json" -> null
      - retention_in_days = 0 -> null
      - tags              = {
          - "Environment" = "prod"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "stack"       = "prod"
        } -> null
    }

  # module.stateful.aws_cloudwatch_log_group.bfd_server_aurora_access_txt will be destroyed
  - resource "aws_cloudwatch_log_group" "bfd_server_aurora_access_txt" {
      - arn               = "arn:aws:logs:us-east-1:577373831711:log-group:/bfd/prod/bfd-server-aurora/access.txt:*" -> null
      - id                = "/bfd/prod/bfd-server-aurora/access.txt" -> null
      - kms_key_id        = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6" -> null
      - name              = "/bfd/prod/bfd-server-aurora/access.txt" -> null
      - retention_in_days = 0 -> null
      - tags              = {
          - "Environment" = "prod"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "stack"       = "prod"
        } -> null
    }

  # module.stateful.aws_cloudwatch_log_group.bfd_server_aurora_gc will be destroyed
  - resource "aws_cloudwatch_log_group" "bfd_server_aurora_gc" {
      - arn               = "arn:aws:logs:us-east-1:577373831711:log-group:/bfd/prod/bfd-server-aurora/gc.log:*" -> null
      - id                = "/bfd/prod/bfd-server-aurora/gc.log" -> null
      - kms_key_id        = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6" -> null
      - name              = "/bfd/prod/bfd-server-aurora/gc.log" -> null
      - retention_in_days = 0 -> null
      - tags              = {
          - "Environment" = "prod"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "stack"       = "prod"
        } -> null
    }

  # module.stateful.aws_cloudwatch_log_group.bfd_server_aurora_messages_json will be destroyed
  - resource "aws_cloudwatch_log_group" "bfd_server_aurora_messages_json" {
      - arn               = "arn:aws:logs:us-east-1:577373831711:log-group:/bfd/prod/bfd-server-aurora/messages.json:*" -> null
      - id                = "/bfd/prod/bfd-server-aurora/messages.json" -> null
      - kms_key_id        = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6" -> null
      - name              = "/bfd/prod/bfd-server-aurora/messages.json" -> null
      - retention_in_days = 0 -> null
      - tags              = {
          - "Environment" = "prod"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "stack"       = "prod"
        } -> null
    }

  # module.stateful.aws_cloudwatch_log_group.bfd_server_aurora_newrelic_agent will be destroyed
  - resource "aws_cloudwatch_log_group" "bfd_server_aurora_newrelic_agent" {
      - arn               = "arn:aws:logs:us-east-1:577373831711:log-group:/bfd/prod/bfd-server-aurora/newrelic_agent.log:*" -> null
      - id                = "/bfd/prod/bfd-server-aurora/newrelic_agent.log" -> null
      - kms_key_id        = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6" -> null
      - name              = "/bfd/prod/bfd-server-aurora/newrelic_agent.log" -> null
      - retention_in_days = 0 -> null
      - tags              = {
          - "Environment" = "prod"
          - "application" = "bfd"
          - "business"    = "oeda"
          - "stack"       = "prod"
        } -> null
    }

  # module.stateful.module.aurora.aws_db_parameter_group.aurora_node will be created
  + resource "aws_db_parameter_group" "aurora_node" {
      + arn         = (known after apply)
      + description = "Sets node parameters for aurora-postgresql11"
      + family      = "aurora-postgresql11"
      + id          = (known after apply)
      + name        = "bfd-prod-aurora-node"
      + name_prefix = (known after apply)

      + parameter {
          + apply_method = "immediate"
          + name         = "auto_explain.log_analyze"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "auto_explain.log_buffers"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "auto_explain.log_min_duration"
          + value        = "6000"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "auto_explain.log_nested_statements"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "auto_explain.log_timing"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_connections"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_lock_waits"
          + value        = "1"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_min_duration_statement"
          + value        = "6000"
        }
      + parameter {
          + apply_method = "immediate"
          + name         = "log_temp_files"
          + value        = "1"
        }
      + parameter {
          + apply_method = "pending-reboot"
          + name         = "shared_preload_libraries"
          + value        = "pg_stat_statements,auto_explain"
        }
    }

  # module.stateful.module.aurora.aws_db_subnet_group.aurora_cluster will be created
  + resource "aws_db_subnet_group" "aurora_cluster" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "bfd-prod-aurora-cluster"
      + name_prefix = (known after apply)
      + subnet_ids  = [
          + "subnet-072b211370d47006a",
          + "subnet-0a6d8b4ffb8d264f0",
          + "subnet-0f2b35f641874f623",
        ]
      + tags        = {
          + "Environment" = "prod"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "stack"       = "prod"
        }
    }

  # module.stateful.module.aurora.aws_rds_cluster.aurora_cluster will be created
  + resource "aws_rds_cluster" "aurora_cluster" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + availability_zones              = [
          + "us-east-1a",
          + "us-east-1b",
          + "us-east-1c",
        ]
      + backup_retention_period         = 21
      + cluster_identifier              = "bfd-prod-aurora-cluster"
      + cluster_identifier_prefix       = (known after apply)
      + cluster_members                 = (known after apply)
      + cluster_resource_id             = (known after apply)
      + copy_tags_to_snapshot           = true
      + database_name                   = (known after apply)
      + db_cluster_parameter_group_name = (known after apply)
      + db_subnet_group_name            = "bfd-prod-aurora-cluster"
      + deletion_protection             = true
      + enabled_cloudwatch_logs_exports = [
          + "postgresql",
        ]
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_mode                     = "provisioned"
      + engine_version                  = "11.6"
      + final_snapshot_identifier       = "bfd-prod-aurora-cluster-final"
      + hosted_zone_id                  = (known after apply)
      + id                              = (known after apply)
      + kms_key_id                      = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6"
      + master_password                 = (sensitive value)
      + master_username                 = "bfduser"
      + port                            = (known after apply)
      + preferred_backup_window         = "05:00-06:00"
      + preferred_maintenance_window    = "fri:07:00-fri:08:00"
      + reader_endpoint                 = (known after apply)
      + skip_final_snapshot             = false
      + storage_encrypted               = true
      + tags                            = {
          + "Environment" = "prod"
          + "Layer"       = "data"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "stack"       = "prod"
        }
      + vpc_security_group_ids          = (known after apply)
    }

  # module.stateful.module.aurora.aws_rds_cluster_instance.aurora_nodes[0] will be created
  + resource "aws_rds_cluster_instance" "aurora_nodes" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = "us-east-1a"
      + cluster_identifier              = (known after apply)
      + copy_tags_to_snapshot           = true
      + db_parameter_group_name         = "bfd-prod-aurora-node"
      + db_subnet_group_name            = "bfd-prod-aurora-cluster"
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_version                  = "11.6"
      + id                              = (known after apply)
      + identifier                      = "bfd-prod-aurora-node-0"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.r5.12xlarge"
      + kms_key_id                      = (known after apply)
      + monitoring_interval             = 15
      + monitoring_role_arn             = "arn:aws:iam::577373831711:role/rds-monitoring-role"
      + performance_insights_enabled    = true
      + performance_insights_kms_key_id = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6"
      + port                            = (known after apply)
      + preferred_backup_window         = "05:00-06:00"
      + preferred_maintenance_window    = "fri:07:00-fri:08:00"
      + promotion_tier                  = 0
      + publicly_accessible             = false
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "Environment" = "prod"
          + "Layer"       = "data"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "stack"       = "prod"
        }
      + writer                          = (known after apply)
    }

  # module.stateful.module.aurora.aws_rds_cluster_instance.aurora_nodes[1] will be created
  + resource "aws_rds_cluster_instance" "aurora_nodes" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = "us-east-1b"
      + cluster_identifier              = (known after apply)
      + copy_tags_to_snapshot           = true
      + db_parameter_group_name         = "bfd-prod-aurora-node"
      + db_subnet_group_name            = "bfd-prod-aurora-cluster"
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_version                  = "11.6"
      + id                              = (known after apply)
      + identifier                      = "bfd-prod-aurora-node-1"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.r5.12xlarge"
      + kms_key_id                      = (known after apply)
      + monitoring_interval             = 15
      + monitoring_role_arn             = "arn:aws:iam::577373831711:role/rds-monitoring-role"
      + performance_insights_enabled    = true
      + performance_insights_kms_key_id = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6"
      + port                            = (known after apply)
      + preferred_backup_window         = "05:00-06:00"
      + preferred_maintenance_window    = "fri:07:00-fri:08:00"
      + promotion_tier                  = 0
      + publicly_accessible             = false
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "Environment" = "prod"
          + "Layer"       = "data"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "stack"       = "prod"
        }
      + writer                          = (known after apply)
    }

  # module.stateful.module.aurora.aws_rds_cluster_instance.aurora_nodes[2] will be created
  + resource "aws_rds_cluster_instance" "aurora_nodes" {
      + apply_immediately               = (known after apply)
      + arn                             = (known after apply)
      + auto_minor_version_upgrade      = true
      + availability_zone               = "us-east-1c"
      + cluster_identifier              = (known after apply)
      + copy_tags_to_snapshot           = true
      + db_parameter_group_name         = "bfd-prod-aurora-node"
      + db_subnet_group_name            = "bfd-prod-aurora-cluster"
      + dbi_resource_id                 = (known after apply)
      + endpoint                        = (known after apply)
      + engine                          = "aurora-postgresql"
      + engine_version                  = "11.6"
      + id                              = (known after apply)
      + identifier                      = "bfd-prod-aurora-node-2"
      + identifier_prefix               = (known after apply)
      + instance_class                  = "db.r5.12xlarge"
      + kms_key_id                      = (known after apply)
      + monitoring_interval             = 15
      + monitoring_role_arn             = "arn:aws:iam::577373831711:role/rds-monitoring-role"
      + performance_insights_enabled    = true
      + performance_insights_kms_key_id = "arn:aws:kms:us-east-1:577373831711:key/82901607-504c-40b0-85bc-3be929ca10e6"
      + port                            = (known after apply)
      + preferred_backup_window         = "05:00-06:00"
      + preferred_maintenance_window    = "fri:07:00-fri:08:00"
      + promotion_tier                  = 0
      + publicly_accessible             = false
      + storage_encrypted               = (known after apply)
      + tags                            = {
          + "Environment" = "prod"
          + "Layer"       = "data"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "stack"       = "prod"
        }
      + writer                          = (known after apply)
    }

  # module.stateful.module.aurora.aws_route53_record.aurora_reader will be created
  + resource "aws_route53_record" "aurora_reader" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "aurora-reader"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z0273533JQSRTP0OEGN6"
    }

  # module.stateful.module.aurora.aws_route53_record.aurora_writer will be created
  + resource "aws_route53_record" "aurora_writer" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "aurora-writer"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "Z0273533JQSRTP0OEGN6"
    }

  # module.stateful.module.aurora.aws_security_group.aurora_cluster will be created
  + resource "aws_security_group" "aurora_cluster" {
      + arn                    = (known after apply)
      + description            = "Security group for aurora cluster"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "bfd-prod-aurora-cluster"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "prod"
          + "Name"        = "bfd-prod-aurora-cluster"
          + "application" = "bfd"
          + "business"    = "oeda"
          + "stack"       = "prod"
        }
      + vpc_id                 = "vpc-045cdabbd5bdb0427"
    }

  # module.stateful.module.aurora.random_password.aurora_cluster will be created
  + resource "random_password" "aurora_cluster" {
      + id          = (known after apply)
      + length      = 20
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

Plan: 10 to add, 0 to change, 6 to destroy.
```